Templates/disc_template/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false; // Keep false for initial AoA sweeps to ensure stability

geometry
{
    disc.stl   { type triSurfaceMesh; name disc; }
    rotor.stl  { type triSurfaceMesh; name rotor; }
    tunnel.stl { type triSurfaceMesh; name tunnel; }
}

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 5000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;

    features
    (
        // Refine edges of the disc specifically
        { file "disc.eMesh"; level 4; }
    );

    refinementSurfaces
    {
        disc
        {
            level ({{ refinement_level_min }} {{ refinement_level_max }});
            patchInfo { type wall; }
        }
        rotor
        {
            level (2 2);
            faceType boundary;
            cellZone rotatingZone;
            faceZone rotatingZone;
            cellZoneInside inside;
        }
        tunnel
        {
            level (0 0);
            patchInfo { type wall; }
        }
    }

    resolveFeatureAngle 30;

    // Location must be in the "Air" - assuming tunnel is large and disc is at 0,0,0
    // (X Y Z) - Adjust this if your tunnel box is smaller than 5 meters
    locationInMesh (2.0 2.0 2.0); 
    
    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 300;
    nRelaxIter 5;
    nFeatureSnapIter 10;
}

addLayersControls { /* Keep empty for baseline sweeps */ }

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    relaxed { maxNonOrtho 75; }
}

mergeTolerance 1e-6;

// ************************************************************************* //
